/* description for query finished growl notification */
"%@" = "%@";

/* text showing how many rows are selected */
"%@ %@ selected" = "%1$@ %2$@ selected";

/* History item filtered by values label */
"%@ (Filtered by %@)" = "%1$@ (Filtered by %2$@)";

/* History item with page number label */
"%@ (Page %lu)" = "%1$@ (Page %2$lu)";

/* Initial favourite name after duplicating a previous favourite */
"%@ Copy" = "%@ Copy";

/* text showing a single row a partially loaded result */
"%@ row in partial load" = "%@ row in partial load";

/* text showing a single row in the result */
"%@ row in table" = "%@ row in table";

/* text showing how a single rows matched filter */
"%@ row of %@%@ matches filter" = "%1$@ row of %2$@%3$@ matches filter";

/* text showing how many rows are in a partially loaded result */
"%@ rows in partial load" = "%@ rows in partial load";

/* text showing how many rows are in the result */
"%@ rows in table" = "%@ rows in table";

/* text showing how many rows matched filter */
"%@ rows of %@%@ match filter" = "%1$@ rows of %2$@%3$@ match filter";

/* Error display text, showing original MySQL error */
"%@\n\nMySQL said: %@" = "%1$@\n\nMySQL said: %2$@";

/* %ld of %@%lu records */
"%ld of %@%lu records" = "%1$ld of %2$@%3$lu records";

/* message of panel when not all selected fields have been deleted by using primary keys */
"%ld row%@ ha%@ not been deleted. Reload the table to be sure that the rows exist and check the Console for possible errors inside the primary key%@ for your table." = "%1$ld row%2$@ ha%3$@ not been deleted. Reload the table to be sure that the rows exist and check the Console for possible errors inside the primary key%4$@ for your table.";

/* message of panel when not all selected fields have been deleted */
"%ld row%@ ha%@ not been deleted. Reload the table to be sure that the rows exist and use a primary key for your table." = "%1$ld row%2$@ ha%3$@ not been deleted. Reload the table to be sure that the rows exist and use a primary key for your table.";

/* message of panel when more rows were deleted */
"%ld row%@ more %@ deleted! Please check the Console and inform the Sequel Pro team!" = "%1$ld row%2$@ more %3$@ deleted! Please check the Console and inform the Sequel Pro team!";

/* text showing how many rows have been affected by multiple queries */
"%ld rows affected in total, by %ld queries taking %@" = "%1$ld rows affected in total, by %2$ld queries taking %3$@";

/* text showing how many rows have been affected by a single query */
"%ld rows affected, taking %@" = "%1$ld rows affected, taking %2$@";

/* filtered item count */
"%lu of %lu" = "%1$lu of %2$lu";

/* History item title with nothing selected */
"(no selection)" = "(no selection)";

/* value shown for hidden blob and text fields */
"(not loaded)" = "(not loaded)";

/* warning shown in the console when no rows have been affected after writing to the db */
"/* WARNING %@ No rows have been affected */\n" = "/* WARNING %@ No rows have been affected */\n";

/* text showing one row has been affected by multiple queries */
"1 row affected in total, by %ld queries taking %@" = "1 row affected in total, by %1$ld queries taking %2$@";

/* text showing one row has been affected by a single query */
"1 row affected, taking %@" = "1 row affected, taking %@";

/* error text when multiple custom query failed */
"[ERROR in query %ld] %@\n" = "[ERROR in query %1$ld] %2$@\n";

/* error text when reading of csv file gave errors */
"[ERROR in row %ld] %@\n" = "[ERROR in row %1$ld] %2$@\n";

/* [multiple selection] */
"[multiple selection]" = "[multiple selection]";

/* [no selection] */
"[no selection]" = "[no selection]";

/* \n\npress shift for binary search tooltip message */
"\n\nPress ⇧ for binary search (case-sensitive)." = "\n\nPress ⇧ for binary search (case-sensitive).";

/* connection failed due to access denied title */
"Access denied!" = "Access denied!";

/* active connection window is busy. please wait and try again. tooltip */
"Active connection window is busy. Please wait and try again." = "Active connection window is busy. Please wait and try again.";

/* Add trigger button */
"Add" = "Add";

/* menu item to add db */
"Add Database..." = "Add Database...";

/* Add Host */
"Add Host" = "Add Host";

/* add global value or expression menu item */
"Add Value or Expression…" = "Add Value or Expression…";

/* adding index task status message */
"Adding index..." = "Adding index...";

/* No comment provided by engineer. */
"Alerts & Logs" = "Alerts & Logs";

/* Growl notification preferences alert message */
"All Growl notifications are enabled by default. To change which notifications are displayed, go to the Growl Preference Pane in the System Preferences and choose what notifications Growl should display from Sequel Pro." = "All Growl notifications are enabled by default. To change which notifications are displayed, go to the Growl Preference Pane in the System Preferences and choose what notifications Growl should display from Sequel Pro.";

/* no connection available informatie message */
"An error has occured and there doesn't seem to be a connection available." = "An error has occured and there doesn't seem to be a connection available.";

/* error killing query informative message */
"An error occured while attempting to kill connection %lu.\n\nMySQL said: %@" = "An error occured while attempting to kill connection %1$lu.\n\nMySQL said: %2$@";

/* error killing query informative message */
"An error occured while attempting to kill the query associated with connection %lu.\n\nMySQL said: %@" = "An error occured while attempting to kill the query associated with connection %1$lu.\n\nMySQL said: %2$@";

/* Error shown when unable to show create table syntax */
"An error occured while creating table syntax.\n\n: %@" = "An error occured while creating table syntax.\n\n: %@";

/* rename table error - no temporary name found */
"An error occured while renaming '%@'. No temporary name could be found. Please try renaming to something else first." = "An error occured while renaming '%@'. No temporary name could be found. Please try renaming to something else first.";

/* rename table error informative message */
"An error occured while renaming '%@'.\n\nMySQL said: %@" = "An error occured while renaming '%1$@'.\n\nMySQL said: %2$@";

/* rename error - don't know what type the renamed thing is */
"An error occured while renaming. '%@' is of an unknown type." = "An error occured while renaming. '%@' is of an unknown type.";

/* rename precedure/function error - can't delete old procedure */
"An error occured while renaming. I couldn't delete '%@'.\n\nMySQL said: %@" = "An error occured while renaming. I couldn't delete '%1$@'.\n\nMySQL said: %2$@";

/* rename precedure/function error - can't recreate procedure */
"An error occured while renaming. I couldn't recreate '%@'.\n\nMySQL said: %@" = "An error occured while renaming. I couldn't recreate '%1$@'.\n\nMySQL said: %2$@";

/* rename precedure/function error - can't retrieve syntax */
"An error occured while renaming. I couldn't retrieve the syntax for '%@'.\n\nMySQL said: %@" = "An error occured while renaming. I couldn't retrieve the syntax for '%1$@'.\n\nMySQL said: %2$@";

/* rename error - invalid create syntax */
"An error occured while renaming. The CREATE syntax of '%@' could not be parsed." = "An error occured while renaming. The CREATE syntax of '%@' could not be parsed.";

/* message of panel when retrieving view information failed */
"An error occured while retrieving status data.\nMySQL said: %@" = "An error occured while retrieving status data.\nMySQL said: %@";

/* message of panel when create syntax cannot be retrieved */
"An error occured while retrieving the create syntax for '%@'.\nMySQL said: %@" = "An error occured while retrieving the create syntax for '%1$@'.\nMySQL said: %2$@";

/* message when the query that fetches the primary keys fails */
"An error occured while retrieving the PRIMARY KEY data:\n\n%@" = "An error occured while retrieving the PRIMARY KEY data:\n\n%@";

/* add index error informative message */
"An error occured while trying to add the index.\n\nMySQL said: %@" = "An error occured while trying to add the index.\n\nMySQL said: %@";

/* error adding password to keychain informative message */
"An error occured while trying to add the password to your Keychain. Repairing your Keychain might resolve this, but if it doesn't please report it to the Sequel Pro team, supplying the error code %i." = "An error occured while trying to add the password to your Keychain. Repairing your Keychain might resolve this, but if it doesn't please report it to the Sequel Pro team, supplying the error code %i.";

/* copy table data error informative message */
"An error occured while trying to copy a table's data.\n\nMySQL said: %@" = "An error occured while trying to copy a table's data.\n\nMySQL said: %@";

/* copy table error informative message */
"An error occured while trying to copy a table.\n\nMySQL said: %@" = "An error occured while trying to copy a table.\n\nMySQL said: %@";

/* create database error informative message */
"An error occured while trying to create a database.\n\nMySQL said: %@" = "An error occured while trying to create a database.\n\nMySQL said: %@";

/* create database error informative message */
"An error occured while trying to create the target database.\n\nDatabase %@ already exists." = "An error occured while trying to create the target database.\n\nDatabase %@ already exists.";

/* create database error informative message */
"An error occured while trying to create the target database.\n\nMySQL said: %@" = "An error occured while trying to create the target database.\n\nMySQL said: %@";

/* error deleting index informative message */
"An error occured while trying to delete the index.\n\nMySQL said: %@" = "An error occured while trying to delete the index.\n\nMySQL said: %@";

/* drop database error informative message */
"An error occured while trying to drop a database.\n\nMySQL said: %@" = "An error occured while trying to drop a database.\n\nMySQL said: %@";

/* move table error informative message */
"An error occured while trying to move a table.\n\nMySQL said: %@" = "An error occured while trying to move a table.\n\nMySQL said: %@";

/* database list error informative message */
"An error occured while trying to retrieve a list of databases.\n\nMySQL said: %@" = "An error occured while trying to retrieve a list of databases.\n\nMySQL said: %@";

/* show create table error informative message */
"An error occured while trying to retrieve the create table statement for a table.\n\nMySQL said: %@" = "An error occured while trying to retrieve the create table statement for a table.\n\nMySQL said: %@";

/* MySQL table info retrieval error message */
"An error occurred retrieving table information.  MySQL said: %@" = "An error occurred retrieving table information.  MySQL said: %@";

/* SQL encoding read error */
"An error occurred when reading the file, as it could not be read in the encoding you selected (%@).\n\nOnly %ld queries were executed." = "An error occurred when reading the file, as it could not be read in the encoding you selected (%1$@).\n\nOnly %2$ld queries were executed.";

/* CSV encoding read error */
"An error occurred when reading the file, as it could not be read using the encoding you selected (%@).\n\nOnly %ld rows were imported." = "An error occurred when reading the file, as it could not be read using the encoding you selected (%1$@).\n\nOnly %2$ld rows were imported.";

/* SQL read error, including detail from system */
"An error occurred when reading the file.\n\nOnly %ld queries were executed.\n\n(%@)" = "An error occurred when reading the file.\n\nOnly %1$ld queries were executed.\n\n(%2$@)";

/* CSV read error, including detail string from system */
"An error occurred when reading the file.\n\nOnly %ld rows were imported.\n\n(%@)" = "An error occurred when reading the file.\n\nOnly %1$ld rows were imported.\n\n(%2$@)";

/* error adding field informative message */
"An error occurred when trying to add the field '%@'.\n\nMySQL said: %@" = "An error occurred when trying to add the field '%1$@'.\n\nMySQL said: %2$@";

/* error changing field informative message */
"An error occurred when trying to change the field '%@'.\n\nMySQL said: %@" = "An error occurred when trying to change the field '%1$@'.\n\nMySQL said: %2$@";

/* error changing table collation informative message */
"An error occurred when trying to change the table collation to '%@'.\n\nMySQL said: %@" = "An error occurred when trying to change the table collation to '%1$@'.\n\nMySQL said: %2$@";

/* error changing table encoding informative message */
"An error occurred when trying to change the table encoding to '%@'.\n\nMySQL said: %@" = "An error occurred when trying to change the table encoding to '%1$@'.\n\nMySQL said: %2$@";

/* error changing table type informative message */
"An error occurred when trying to change the table type to '%@'.\n\nMySQL said: %@" = "An error occurred when trying to change the table type to '%1$@'.\n\nMySQL said: %2$@";

/* error changing table comment informative message */
"An error occurred when trying to change the table's comment to '%@'.\n\nMySQL said: %@" = "An error occurred when trying to change the table's comment to '%1$@'.\n\nMySQL said: %2$@";

/* an error occurred while analyzing the %@.\n\nMySQL said:%@ */
"An error occurred while analyzing the %@.\n\nMySQL said:%@" = "An error occurred while analyzing the %1$@.\n\nMySQL said:%2$@";

/* an error occurred while trying to flush the %@.\n\nMySQL said:%@ */
"An error occurred while flushing the %@.\n\nMySQL said:%@" = "An error occurred while flushing the %1$@.\n\nMySQL said:%2$@";

/* an error occurred while trying to optimze the %@.\n\nMySQL said:%@ */
"An error occurred while optimzing the %@.\n\nMySQL said:%@" = "An error occurred while optimzing the %1$@.\n\nMySQL said:%2$@";

/* an error occurred while performing the checksum on the %@.\n\nMySQL said:%@ */
"An error occurred while performing the checksum on %@.\n\nMySQL said:%@" = "An error occurred while performing the checksum on %1$@.\n\nMySQL said:%2$@";

/* an error occurred while trying to repair the %@.\n\nMySQL said:%@ */
"An error occurred while repairing the %@.\n\nMySQL said:%@" = "An error occurred while repairing the %1$@.\n\nMySQL said:%2$@";

/* message of panel when retrieving information failed */
"An error occurred while retrieving information.\nMySQL said: %@" = "An error occurred while retrieving information.\nMySQL said: %@";

/* error retrieving table information informative message */
"An error occurred while retrieving the information for table '%@'. Please try again.\n\nMySQL said: %@" = "An error occurred while retrieving the information for table '%1$@'. Please try again.\n\nMySQL said: %2$@";

/* error retrieving table information informative message */
"An error occurred while retrieving the trigger information for table '%@'. Please try again.\n\nMySQL said: %@" = "An error occurred while retrieving the trigger information for table '%1$@'. Please try again.\n\nMySQL said: %2$@";

/* error adding new table informative message */
"An error occurred while trying to add the new table '%@'.\n\nMySQL said: %@" = "An error occurred while trying to add the new table '%1$@'.\n\nMySQL said: %2$@";

/* error while trying to alter table message */
"An error occurred while trying to alter table '%@'.\n\nMySQL said: %@" = "An error occurred while trying to alter table '%1$@'.\n\nMySQL said: %2$@";

/* an error occurred while trying to check the %@.\n\nMySQL said:%@ */
"An error occurred while trying to check the %@.\n\nMySQL said:%@" = "An error occurred while trying to check the %1$@.\n\nMySQL said:%2$@";

/* error deleting relation informative message */
"An error occurred while trying to delete the relation '%@'.\n\nMySQL said: %@" = "An error occurred while trying to delete the relation '%1$@'.\n\nMySQL said: %2$@";

/* unable to get list of users informative message */
"An error occurred while trying to get the list of users. Please make sure you have the necessary privileges to perform user management, including access to the mysql.user table." = "An error occurred while trying to get the list of users. Please make sure you have the necessary privileges to perform user management, including access to the mysql.user table.";

/* error moving field informative message */
"An error occurred while trying to move the field.\n\nMySQL said: %@" = "An error occurred while trying to move the field.\n\nMySQL said: %@";

/* error resetting auto_increment informative message */
"An error occurred while trying to reset AUTO_INCREMENT of table '%@'.\n\nMySQL said: %@" = "An error occurred while trying to reset AUTO_INCREMENT of table '%1$@'.\n\nMySQL said: %2$@";

/* error truncating table informative message */
"An error occurred while trying to truncate the table '%@'.\n\nMySQL said: %@" = "An error occurred while trying to truncate the table '%1$@'.\n\nMySQL said: %2$@";

/* ANALYZE one or more tables - result title */
"Analyze %@" = "Analyze %@";

/* analyze selected items menu item */
"Analyze Selected Items" = "Analyze Selected Items";

/* analyze table menu item */
"Analyze Table" = "Analyze Table";

/* analyze table failed message */
"Analyze table failed." = "Analyze table failed.";

/* clear global history list informative message */
"Are you sure you want to clear the global history list? This action cannot be undone." = "Are you sure you want to clear the global history list? This action cannot be undone.";

/* clear history list for “%@” informative message */
"Are you sure you want to clear the history list for “%@”? This action cannot be undone." = "Are you sure you want to clear the history list for “%@”? This action cannot be undone.";

/* truncate tables informative message */
"Are you sure you want to delete ALL records in the selected tables? This operation cannot be undone." = "Are you sure you want to delete ALL records in the selected tables? This operation cannot be undone.";

/* truncate table informative message */
"Are you sure you want to delete ALL records in the table '%@'? This operation cannot be undone." = "Are you sure you want to delete ALL records in the table '%@'? This operation cannot be undone.";

/* delete all rows informative message */
"Are you sure you want to delete all the rows from this table? This action cannot be undone." = "Are you sure you want to delete all the rows from this table? This action cannot be undone.";

/* delete table/view informative message */
"Are you sure you want to delete the %@ '%@'? This operation cannot be undone." = "Are you sure you want to delete the %1$@ '%2$@'? This operation cannot be undone.";

/* delete database informative message */
"Are you sure you want to delete the database '%@'? This operation cannot be undone." = "Are you sure you want to delete the database '%@'? This operation cannot be undone.";

/* delete database informative message */
"Are you sure you want to delete the favorite '%@'? This operation cannot be undone." = "Are you sure you want to delete the favorite '%@'? This operation cannot be undone.";

/* delete field informative message */
"Are you sure you want to delete the field '%@'? This action cannot be undone." = "Are you sure you want to delete the field '%@'? This action cannot be undone.";

/* delete index informative message */
"Are you sure you want to delete the index '%@'? This action cannot be undone." = "Are you sure you want to delete the index '%@'? This action cannot be undone.";

/* delete tables/views informative message */
"Are you sure you want to delete the selected %@? This operation cannot be undone." = "Are you sure you want to delete the selected %@? This operation cannot be undone.";

/* delete rows informative message */
"Are you sure you want to delete the selected %ld rows from this table? This action cannot be undone." = "Are you sure you want to delete the selected %ld rows from this table? This action cannot be undone.";

/* delete selected relation informative message */
"Are you sure you want to delete the selected relations? This action cannot be undone." = "Are you sure you want to delete the selected relations? This action cannot be undone.";

/* delete selected row informative message */
"Are you sure you want to delete the selected row from this table? This action cannot be undone." = "Are you sure you want to delete the selected row from this table? This action cannot be undone.";

/* delete selected trigger informative message */
"Are you sure you want to delete the selected triggers? This action cannot be undone." = "Are you sure you want to delete the selected triggers? This action cannot be undone.";

/* kill connection informative message */
"Are you sure you want to kill connection ID %lu?\n\nPlease be aware that continuing to kill this connection may result in data corruption. Please proceed with caution." = "Are you sure you want to kill connection ID %lu?\n\nPlease be aware that continuing to kill this connection may result in data corruption. Please proceed with caution.";

/* kill query informative message */
"Are you sure you want to kill the current query executing on connection ID %lu?\n\nPlease be aware that continuing to kill this query may result in data corruption. Please proceed with caution." = "Are you sure you want to kill the current query executing on connection ID %lu?\n\nPlease be aware that continuing to kill this query may result in data corruption. Please proceed with caution.";

/* continue to print informative message */
"Are you sure you want to print the current content view of the table '%@'?\n\nIt currently contains %@ rows, which may take a significant amount of time to print." = "Are you sure you want to print the current content view of the table '%1$@'?\n\nIt currently contains %2$@ rows, which may take a significant amount of time to print.";

/* remove all query favorites informative message */
"Are you sure you want to remove all of your saved query favorites? This action cannot be undone." = "Are you sure you want to remove all of your saved query favorites? This action cannot be undone.";

/* remove all selected content filters informative message */
"Are you sure you want to remove all selected content filters? This action cannot be undone." = "Are you sure you want to remove all selected content filters? This action cannot be undone.";

/* remove all selected query favorites informative message */
"Are you sure you want to remove all selected query favorites? This action cannot be undone." = "Are you sure you want to remove all selected query favorites? This action cannot be undone.";

/* No comment provided by engineer. */
"Auto Update" = "Auto Update";

/* auto_increment: %@ */
"auto_increment: %@" = "auto_increment: %@";

/* Encoding autodetect menu item */
"Autodetect" = "Autodetect";

/* bash error */
"BASH Error" = "BASH Error";

/* toolbar item label for switching to the Table Content tab */
"Browse & Edit Table Content" = "Browse & Edit Table Content";

/* build label */
"Build" = "Build";

/* build label */
"build" = "build";

/* error text when trying to import csv data, but we have no tables in the db */
"Can't import CSV data into a database without any tables!" = "Can't import CSV data into a database without any tables!";

/* cancel button */
"Cancel" = "Cancel";

/* text showing a query was cancelled */
"Cancelled after %@" = "Cancelled after %@";

/* text showing multiple queries were cancelled */
"Cancelled in query %ld, after %@" = "Cancelled in query %1$ld, after %2$@";

/* cancelling task status message */
"Cancelling..." = "Cancelling...";

/* create database exists error message */
"Cannot create existing database" = "Cannot create existing database";

/* empty query informative message */
"Cannot save an empty query." = "Cannot save an empty query.";

/* change focus to table list menu item */
"Change Focus to Table List" = "Change Focus to Table List";

/* CHECK one or more tables - result title */
"Check %@" = "Check %@";

/* check of all selected items successfully passed message */
"Check of all selected items successfully passed." = "Check of all selected items successfully passed.";

/* check selected items menu item */
"Check Selected Items" = "Check Selected Items";

/* check table menu item */
"Check Table" = "Check Table";

/* check table failed message */
"Check table failed." = "Check table failed.";

/* check table successfully passed message */
"Check table successfully passed." = "Check table successfully passed.";

/* check view menu item */
"Check View" = "Check View";

/* checksum %@ message */
"Checksum %@" = "Checksum %@";

/* checksum selected items menu item */
"Checksum Selected Items" = "Checksum Selected Items";

/* checksum table menu item */
"Checksum Table" = "Checksum Table";

/* Checksums of %@ message */
"Checksums of %@" = "Checksums of %@";

/* menu item for choose db */
"Choose Database..." = "Choose Database...";

/* cancelling export cleaning up message */
"Cleaning up..." = "Cleaning up...";

/* clear button */
"Clear" = "Clear";

/* toolbar item for clear console */
"Clear Console" = "Clear Console";

/* clear global history menu item title */
"Clear Global History" = "Clear Global History";

/* clear history for “%@” menu title */
"Clear History for “%@”" = "Clear History for “%@”";

/* clear history message */
"Clear History?" = "Clear History?";

/* tooltip for toolbar item for clear console */
"Clear the console which shows all MySQL commands performed by Sequel Pro" = "Clear the console which shows all MySQL commands performed by Sequel Pro";

/* clear the document-based history list tooltip message */
"Clear the document-based history list" = "Clear the document-based history list";

/* clear the global history list tooltip message */
"Clear the global history list" = "Clear the global history list";

/* Close menu item */
"Close" = "Close";

/* Close Window menu item */
"Close Window" = "Close Window";

/* collation label */
"Collation" = "Collation";

/* comment label */
"Comment" = "Comment";

/* Title of action menu item to comment line */
"Comment Line" = "Comment Line";

/* Title of action menu item to comment selection */
"Comment Selection" = "Comment Selection";

/* connect button */
"Connect" = "Connect";

/* Connect via socket button */
"Connect via socket" = "Connect via socket";

/* connection established message */
"Connected" = "Connected";

/* description for connected growl notification */
"Connected to %@" = "Connected to %@";

/* message of panel when connection to db failed */
"Connected to host, but unable to connect to database %@.\n\nBe sure that the database exists and that you have the necessary privileges.\n\nMySQL said: %@" = "Connected to host, but unable to connect to database %1$@.\n\nBe sure that the database exists and that you have the necessary privileges.\n\nMySQL said: %2$@";

/* Generic connecting very short status message */
"Connecting..." = "Connecting...";

/* window title string indicating that sp is connecting */
"Connecting…" = "Connecting…";

/* error while reading connection data file */
"Connection data file couldn't be read." = "Connection data file couldn't be read.";

/* message error while reading connection data file and suggesting to save it under a differnet name */
"Connection data file “%@” couldn't be read. Please try to save the document under a different name." = "Connection data file “%@” couldn't be read. Please try to save the document under a different name.";

/* connection failed title */
"Connection failed!" = "Connection failed!";

/* Connection file is encrypted */
"Connection file is encrypted" = "Connection file is encrypted";

/* Console */
"Console" = "Console";

/* toolbar item label for switching to the Table Content tab */
"Content" = "Content";

/* continue button */
"Continue" = "Continue";

/* continue to print message */
"Continue to print?" = "Continue to print?";

/* Copy as RTF */
"Copy as RTF" = "Copy as RTF";

/* copy create func syntax menu item */
"Copy Create Function Syntax" = "Copy Create Function Syntax";

/* copy create proc syntax menu item */
"Copy Create Procedure Syntax" = "Copy Create Procedure Syntax";

/* copy create table syntax menu item */
"Copy Create Table Syntax" = "Copy Create Table Syntax";

/* copy create view syntax menu item */
"Copy Create View Syntax" = "Copy Create View Syntax";

/* copy server variable name menu item */
"Copy Variable Name" = "Copy Variable Name";

/* copy server variable names menu item */
"Copy Variable Names" = "Copy Variable Names";

/* copy server variable value menu item */
"Copy Variable Value" = "Copy Variable Value";

/* copy server variable values menu item */
"Copy Variable Values" = "Copy Variable Values";

/* Procedure/function export permission error */
"Could not export the %@ '%@' because of a permisions error.\n" = "Could not export the %1$@ '%2$@' because of a permisions error.\n";

/* Error when we can't parse/split file as CSV */
"Could not parse file as CSV" = "Could not parse file as CSV";

/* message when database selection failed */
"Could not select database" = "Could not select database";

/* message of panel when table cannot be created */
"Couldn't create '%@'.\nMySQL said: %@" = "Couldn't create '%1$@'.\nMySQL said: %2$@";

/* message of panel when creation of db failed */
"Couldn't create database.\nMySQL said: %@" = "Couldn't create database.\nMySQL said: %@";

/* message of panel when an item cannot be deleted */
"Couldn't delete '%@'.\nMySQL said: %@" = "Couldn't delete '%1$@'.\nMySQL said: %2$@";

/* message of panel when field cannot be deleted */
"Couldn't delete field %@.\nMySQL said: %@" = "Couldn't delete field %1$@.\nMySQL said: %2$@";

/* message when deleteing all rows failed */
"Couldn't delete rows.\n\nMySQL said: %@" = "Couldn't delete rows.\n\nMySQL said: %@";

/* message of panel when deleting db failed */
"Couldn't delete the database.\nMySQL said: %@" = "Couldn't delete the database.\nMySQL said: %@";

/* message of panel when an item cannot be renamed */
"Couldn't duplicate '%@'.\nMySQL said: %@" = "Couldn't duplicate '%1$@'.\nMySQL said: %2$@";

/* message of panel when flushing privs failed */
"Couldn't flush privileges.\nMySQL said: %@" = "Couldn't flush privileges.\nMySQL said: %@";

/* message of panel when table information cannot be retrieved */
"Couldn't get create syntax.\nMySQL said: %@" = "Couldn't get create syntax.\nMySQL said: %@";

/* Custom Query result editing error - could not identify a corresponding column */
"Couldn't identify field origin unambiguously. The column '%@' contains data from more than one table." = "Couldn't identify field origin unambiguously. The column '%@' contains data from more than one table.";

/* message of panel when loading of row failed */
"Couldn't load the row. Reload the table to be sure that the row exists and use a primary key for your table." = "Couldn't load the row. Reload the table to be sure that the row exists and use a primary key for your table.";

/* Couldn't read the file content of */
"Couldn't read the file content of" = "Couldn't read the file content of";

/* message of panel when file cannot be replaced */
"Couldn't replace the file. Be sure that you have the necessary privileges." = "Couldn't replace the file. Be sure that you have the necessary privileges.";

/* text shown if an error occured while sorting the result table */
"Couldn't sort column." = "Couldn't sort column.";

/* message of panel when sorting of table failed */
"Couldn't sort table. MySQL said: %@" = "Couldn't sort table. MySQL said: %@";

/* message of panel when error while updating field to db */
"Couldn't write field.\nMySQL said: %@" = "Couldn't write field.\nMySQL said: %@";

/* Couldn't write row error */
"Couldn't write row" = "Couldn't write row";

/* message of panel when file cannot be written */
"Couldn't write to file. Be sure that you have the necessary privileges." = "Couldn't write to file. Be sure that you have the necessary privileges.";

/* Create syntax label */
"Create syntax for %@ '%@'" = "Create syntax for %1$@ '%2$@'";

/* created: %@ */
"created: %@" = "created: %@";

/* header for current selection in filtered list */
"CURRENT SELECTION" = "CURRENT SELECTION";

/* default customize file name label */
"Customize Filename" = "Customize Filename";

/* customize file name label */
"Customize Filename (%@)" = "Customize Filename (%@)";

/* data access: %@ (%@) */
"data access: %@ (%@)" = "data access: %1$@ (%2$@)";

/* export filename database token */
"database" = "database";

/* csv export database heading */
"Database" = "Database";

/* delete database not empty error informative message */
"Database %@ not empty, skipping drop database." = "Database %@ not empty, skipping drop database.";

/* message of panel when no db name is given */
"Database must have a name." = "Database must have a name.";

/* export filename date token */
"date" = "date";

/* default label */
"Default" = "Default";

/* definer: %@ */
"definer: %@" = "definer: %@";

/* delete button */
"Delete" = "Delete";

/* delete table/view message */
"Delete %@ '%@'?" = "Delete %1$@ '%2$@'?";

/* delete all rows message */
"Delete all rows?" = "Delete all rows?";

/* delete database message */
"Delete database '%@'?" = "Delete database '%@'?";

/* delete database message */
"Delete favorite '%@'?" = "Delete favorite '%@'?";

/* delete field message */
"Delete field '%@'?" = "Delete field '%@'?";

/* delete func menu title */
"Delete Function" = "Delete Function";

/* delete functions menu title */
"Delete Functions" = "Delete Functions";

/* delete index message */
"Delete index '%@'?" = "Delete index '%@'?";

/* delete items menu title */
"Delete Items" = "Delete Items";

/* delete proc menu title */
"Delete Procedure" = "Delete Procedure";

/* delete procedures menu title */
"Delete Procedures" = "Delete Procedures";

/* delete relation menu item */
"Delete Relation" = "Delete Relation";

/* delete relation message */
"Delete relation" = "Delete relation";

/* delete relations menu item */
"Delete Relations" = "Delete Relations";

/* delete rows message */
"Delete rows?" = "Delete rows?";

/* delete tables/views message */
"Delete selected %@?" = "Delete selected %@?";

/* delete selected row message */
"Delete selected row?" = "Delete selected row?";

/* delete table menu title */
"Delete Table" = "Delete Table";

/* delete tables menu title */
"Delete Tables" = "Delete Tables";

/* delete trigger menu item */
"Delete Trigger" = "Delete Trigger";

/* delete trigger message */
"Delete trigger" = "Delete trigger";

/* delete triggers menu item */
"Delete Triggers" = "Delete Triggers";

/* delete view menu title */
"Delete View" = "Delete View";

/* delete views menu title */
"Delete Views" = "Delete Views";

/* discard changes button */
"Discard changes" = "Discard changes";

/* description for disconnected growl notification */
"Disconnected from %@" = "Disconnected from %@";

/* do update operator tooltip */
"Do UPDATE where field contents match" = "Do UPDATE where field contents match";

/* message of panel asking for confirmation for loading large text into the query editor */
"Do you really want to load a SQL file with %@ of data into the Query Editor?" = "Do you really want to load a SQL file with %@ of data into the Query Editor?";

/* message of panel asking for confirmation for inserting large text from dragging action */
"Do you really want to proceed with %@ of data?" = "Do you really want to proceed with %@ of data?";

/* text showing that app is writing dump */
"Dumping..." = "Dumping...";

/* duplicate object message */
"Duplicate %@ '%@' to:" = "Duplicate %1$@ '%2$@' to:";

/* duplicate database message */
"Duplicate database '%@' to:" = "Duplicate database '%@' to:";

/* duplicate func menu title */
"Duplicate Function..." = "Duplicate Function...";

/* duplicate proc menu title */
"Duplicate Procedure..." = "Duplicate Procedure...";

/* duplicate table menu title */
"Duplicate Table..." = "Duplicate Table...";

/* duplicate view menu title */
"Duplicate View..." = "Duplicate View...";

/* Edit trigger button */
"Edit" = "Edit";

/* edit favorites menu item */
"Edit Favorites…" = "Edit Favorites…";

/* edit filter */
"Edit Filters…" = "Edit Filters…";

/* Edit row button */
"Edit row" = "Edit row";

/* toolbar item label for switching to the Table Structure tab */
"Edit Table Structure" = "Edit Table Structure";

/* edit user-defined filter */
"Edit user-defined Filters…" = "Edit user-defined Filters…";

/* empty query message */
"Empty query" = "Empty query";

/* MySQL search language code - eg in http://search.mysql.com/search?q=select&site=refman-50&lr=lang_en */
"en" = "en";

/* encoding label */
"Encoding" = "Encoding";

/* encoding: %@ */
"encoding: %@" = "encoding: %@";

/* SSH key password prompt */
"Enter your password for the SSH key\n\"%@\"" = "Enter your password for the SSH key\n\"%@\"";

/* error */
"Error" = "Error";

/* error adding field message */
"Error adding field" = "Error adding field";

/* error adding new table message */
"Error adding new table" = "Error adding new table";

/* error adding password to keychain message */
"Error adding password to Keychain" = "Error adding password to Keychain";

/* error changing field message */
"Error changing field" = "Error changing field";

/* error changing table collation message */
"Error changing table collation" = "Error changing table collation";

/* error changing table comment message */
"Error changing table comment" = "Error changing table comment";

/* error changing table encoding message */
"Error changing table encoding" = "Error changing table encoding";

/* error changing table type message */
"Error changing table type" = "Error changing table type";

/* error creating relation message */
"Error creating relation" = "Error creating relation";

/* error creating trigger message */
"Error creating trigger" = "Error creating trigger";

/* error for message */
"Error for" = "Error for";

/* error moving field message */
"Error moving field" = "Error moving field";

/* error occurred */
"error occurred" = "error occurred";

/* error retrieving table information message */
"Error retrieving table information" = "Error retrieving table information";

/* error retrieving trigger information message */
"Error retrieving trigger information" = "Error retrieving trigger information";

/* error truncating table message */
"Error truncating table" = "Error truncating table";

/* error while analyzing selected items message */
"Error while analyzing selected items" = "Error while analyzing selected items";

/* error while checking selected items message */
"Error while checking selected items" = "Error while checking selected items";

/* error while converting connection data */
"Error while converting connection data" = "Error while converting connection data";

/* error while converting content filter data */
"Error while converting content filter data" = "Error while converting content filter data";

/* error while converting query favorite data */
"Error while converting query favorite data" = "Error while converting query favorite data";

/* error while converting session data */
"Error while converting session data" = "Error while converting session data";

/* Error while deleting field */
"Error while deleting field" = "Error while deleting field";

/* error while flushing selected items message */
"Error while flushing selected items" = "Error while flushing selected items";

/* error while optimizing selected items message */
"Error while optimizing selected items" = "Error while optimizing selected items";

/* error while parsing CREATE TABLE syntax */
"Error while parsing CREATE TABLE syntax" = "Error while parsing CREATE TABLE syntax";

/* error while reading connection data file */
"Error while reading connection data file" = "Error while reading connection data file";

/* error while reading data file */
"Error while reading data file" = "Error while reading data file";

/* error while repairing selected items message */
"Error while repairing selected items" = "Error while repairing selected items";

/* Plural suffix for row count, eg 4 match*es* */
"es" = "es";

/* execution privilege label */
"Execution Privilege" = "Execution Privilege";

/* execution privilege: %@ */
"execution privilege: %@" = "execution privilege: %@";

/* execution stopped message */
"Execution stopped!\n" = "Execution stopped!\n";

/* text showing that the application is importing a supplied format */
"Exporting %@" = "Exporting %@";

/* text showing that the application is exporting a Dot file */
"Exporting Dot File" = "Exporting Dot File";

/* text showing that the application is exporting SQL */
"Exporting SQL" = "Exporting SQL";

/* extra label */
"Extra" = "Extra";

/* copy table error message */
"Failed to copy table" = "Failed to copy table";

/* copy table data error message */
"Failed to copy table data" = "Failed to copy table data";

/* create database error message */
"Failed to create database" = "Failed to create database";

/* delete database error message */
"Failed to delete database" = "Failed to delete database";

/* drop database error message */
"Failed to drop database" = "Failed to drop database";

/* move table error message */
"Failed to move table" = "Failed to move table";

/* database list error message */
"Failed to retrieve databases list" = "Failed to retrieve databases list";

/* show create table error message */
"Failed to show create table statement" = "Failed to show create table statement";

/* No comment provided by engineer. */
"Fatal Error" = "Fatal Error";

/* Favorites title at the top of the sidebar */
"FAVORITES" = "FAVORITES";

/* No comment provided by engineer. */
"Favorites" = "Favorites";

/* export label showing that the app is fetching data */
"Fetching data..." = "Fetching data...";

/* fetching database structure data in progress */
"fetching database structure data in progress" = "fetching database structure data in progress";

/* fetching database structure in progress */
"fetching database structure in progress" = "fetching database structure in progress";

/* fetching table data for completion in progress message */
"fetching table data…" = "fetching table data…";

/* popup menuitem for field (showing only if disabled) */
"field" = "field";

/* Field */
"Field" = "Field";

/* Custom Query result editing error - could not match row being edited uniquely */
"Field is not editable. Couldn't identify field origin unambiguously (%ld match%@)." = "Field is not editable. Couldn't identify field origin unambiguously (%1$ld match%2$@).";

/* field is not editable due to no table/database */
"Field is not editable. Field has no or multiple table or database origin(s)." = "Field is not editable. Field has no or multiple table or database origin(s).";

/* Custom Query result editing error - could not identify original row */
"Field is not editable. No matching record found. Try to add the primary key field or more fields in your SELECT statement for table '%@' to identify field origin unambiguously." = "Field is not editable. No matching record found. Try to add the primary key field or more fields in your SELECT statement for table '%@' to identify field origin unambiguously.";

/* error while reading data file */
"File couldn't be read." = "File couldn't be read.";

/* CSV read error title
   SQL read error title */
"File read error" = "File read error";

/* Filter placeholder */
"Filter" = "Filter";

/* filter tables menu item */
"Filter Tables" = "Filter Tables";

/* filtering failed. please try again. tooltip */
"Filtering failed. Please try again." = "Filtering failed. Please try again.";

/* Filtering table task description */
"Filtering table..." = "Filtering table...";

/* description for finished exporting growl notification */
"Finished exporting to %@" = "Finished exporting to %@";

/* description for finished importing growl notification */
"Finished importing %@" = "Finished importing %@";

/* FLUSH one or more tables - result title */
"Flush %@" = "Flush %@";

/* flush selected items menu item */
"Flush Selected Items" = "Flush Selected Items";

/* flush table menu item */
"Flush Table" = "Flush Table";

/* flush table failed message */
"Flush table failed." = "Flush table failed.";

/* flush view menu item */
"Flush View" = "Flush View";

/* title of panel when successfully flushed privs */
"Flushed Privileges" = "Flushed Privileges";

/* function */
"function" = "function";

/* header for function info pane */
"FUNCTION INFORMATION" = "FUNCTION INFORMATION";

/* functions */
"functions" = "functions";

/* No comment provided by engineer. */
"General" = "General";

/* generating print document status message */
"Generating print document..." = "Generating print document...";

/* csv export generation time heading */
"Generation Time" = "Generation Time";

/* global value */
"Global value" = "Global value";

/* Growl notification preferences alert title */
"Growl notification preferences" = "Growl notification preferences";

/* help topics for */
"Help topics for" = "Help topics for";

/* hide console */
"Hide Console" = "Hide Console";

/* hide navigator */
"Hide Navigator" = "Hide Navigator";

/* Hide Query Information */
"Hide Query Information" = "Hide Query Information";

/* hide tab bar */
"Hide Tab Bar" = "Hide Tab Bar";

/* Hide Table Information */
"Hide Table Information" = "Hide Table Information";

/* export filename host token */
"host" = "host";

/* csv export host heading */
"Host" = "Host";

/* custom export filename tokens without table */
"host,database,date,time" = "host,database,date,time";

/* default custom export filename tokens */
"host,database,table,date,time" = "host,database,table,date,time";

/* Localized help page for query favourites - do not localize if no translated webpage is available */
"http://www.sequelpro.com/docs/Query_Favorites" = "http://www.sequelpro.com/docs/Query_Favorites";

/* ignore button */
"Ignore" = "Ignore";

/* ignore all fields menu item */
"Ignore all Fields" = "Ignore all Fields";

/* ignore field label */
"Ignore Field" = "Ignore Field";

/* ignore field label */
"Ignore field" = "Ignore field";

/* import button */
"Import" = "Import";

/* import all fields menu item */
"Import all Fields" = "Import all Fields";

/* Import Error title */
"Import Error" = "Import Error";

/* import field operator tooltip */
"Import field" = "Import field";

/* SQL import progress text */
"Imported %@ of %@" = "Imported %1$@ of %2$@";

/* SQL import progress text where total size is unknown */
"Imported %@ of SQL" = "Imported %@ of SQL";

/* text showing that the application is importing CSV */
"Importing CSV" = "Importing CSV";

/* text showing that the application is importing SQL */
"Importing SQL" = "Importing SQL";

/* include content table column tooltip */
"Include content" = "Include content";

/* header for blank info pane */
"INFORMATION" = "INFORMATION";

/* insufficient details message */
"Insufficient connection details" = "Insufficient connection details";

/* insufficient details informative message */
"Insufficient details provided to establish a connection. Please enter at least the hostname." = "Insufficient details provided to establish a connection. Please enter at least the hostname.";

/* insufficient SSH tunnel details informative message */
"Insufficient details provided to establish a connection. Please enter the hostname for the SSH Tunnel, or disable the SSH Tunnel." = "Insufficient details provided to establish a connection. Please enter the hostname for the SSH Tunnel, or disable the SSH Tunnel.";

/* insufficient details informative message */
"Insufficient details provided to establish a connection. Please provide at least a host." = "Insufficient details provided to establish a connection. Please provide at least a host.";

/* Interpret data as: */
"Interpret data as:" = "Interpret data as:";

/* popup menuitem for field IS value */
"is" = "is";

/* is nullable label */
"Is Nullable" = "Is Nullable";

/* items */
"items" = "items";

/* key label */
"Key" = "Key";

/* kill button */
"Kill" = "Kill";

/* kill connection message */
"Kill connection?" = "Kill connection?";

/* kill query message */
"Kill query?" = "Kill query?";

/* Last Used entry in favorites menu */
"Last Used" = "Last Used";

/* Loading table task string */
"Loading %@..." = "Loading %@...";

/* Loading database task string */
"Loading database '%@'..." = "Loading database '%@'...";

/* Loading history entry task desc */
"Loading history entry..." = "Loading history entry...";

/* Loading table page task string */
"Loading page %lu..." = "Loading page %lu...";

/* Loading referece task string */
"Loading reference..." = "Loading reference...";

/* Loading table data string */
"Loading table data..." = "Loading table data...";

/* match field menu item */
"Match Field" = "Match Field";

/* Maximum number of arguments is 2! */
"Maximum number of arguments is 2!" = "Maximum number of arguments is 2!";

/* Maximum text length is set to %ld. */
"Maximum text length is set to %ld." = "Maximum text length is set to %ld.";

/* Maximum text length is set to %ld. Inserted text was truncated. */
"Maximum text length is set to %ld. Inserted text was truncated." = "Maximum text length is set to %ld. Inserted text was truncated.";

/* Maximum text length is set to %llu. */
"Maximum text length is set to %llu." = "Maximum text length is set to %llu.";

/* Maximum text length is set to %llu. Inserted text was truncated. */
"Maximum text length is set to %llu. Inserted text was truncated." = "Maximum text length is set to %llu. Inserted text was truncated.";

/* message column title */
"Message" = "Message";

/* multiple selection */
"multiple selection" = "multiple selection";

/* MySQL connecting very short status message */
"MySQL connecting..." = "MySQL connecting...";

/* mysql error message */
"MySQL Error" = "MySQL Error";

/* mysql help */
"MySQL Help" = "MySQL Help";

/* MySQL Help for Selection */
"MySQL Help for Selection" = "MySQL Help for Selection";

/* MySQL Help for Word */
"MySQL Help for Word" = "MySQL Help for Word";

/* mysql help categories */
"MySQL Help – Categories" = "MySQL Help – Categories";

/* mysql said message */
"MySQL said:" = "MySQL said:";

/* message of panel when error while adding row to db */
"MySQL said:\n\n%@" = "MySQL said:\n\n%@";

/* No comment provided by engineer. */
"Network" = "Network";

/* nightly build label */
"Nightly Build" = "Nightly Build";

/* no connection available message */
"No connection available" = "No connection available";

/* no connection data found */
"No connection data found." = "No connection data found.";

/* error that no content filters found */
"No content filters found." = "No content filters found.";

/* no data found */
"No data found." = "No data found.";

/* no information available */
"no information available" = "no information available";

/* no item found message */
"No item found" = "No item found";

/* SSH tunnel could not be created because no local port could be allocated */
"No local port could be allocated for the SSH Tunnel." = "No local port could be allocated for the SSH Tunnel.";

/* header for no matches in filtered list */
"NO MATCHES" = "NO MATCHES";

/* error that no query favorites found */
"No query favorites found." = "No query favorites found.";

/* not available label */
"Not available" = "Not available";

/* Number of arguments: %lu */
"Number of arguments: %lu" = "Number of arguments: %lu";

/* OK button */
"OK" = "OK";

/* Only one dragged item allowed. */
"Only one dragged item allowed." = "Only one dragged item allowed.";

/* menu item open in new window */
"Open in New Window" = "Open in New Window";

/* menu item open “%@” in new window */
"Open “%@” in New Window" = "Open “%@” in New Window";

/* OPTIMIZE one or more tables - result title */
"Optimize %@" = "Optimize %@";

/* optimize selected items menu item */
"Optimize Selected Items" = "Optimize Selected Items";

/* optimize table menu item */
"Optimize Table" = "Optimize Table";

/* optimize table failed message */
"Optimize table failed." = "Optimize table failed.";

/* Permission Denied */
"Permission Denied" = "Permission Denied";

/* message of panel when ssh details are incomplete */
"Please enter the hostname for the SSH Tunnel, or disable the SSH Tunnel." = "Please enter the hostname for the SSH Tunnel, or disable the SSH Tunnel.";

/* Please enter the password */
"Please enter the password for ‘%@’:" = "Please enter the password for ‘%@’:";

/* print button */
"Print" = "Print";

/* privileges label */
"Privileges" = "Privileges";

/* procedure */
"procedure" = "procedure";

/* header for procedure info pane */
"PROCEDURE INFORMATION" = "PROCEDURE INFORMATION";

/* procedures */
"procedures" = "procedures";

/* header for procs & funcs list */
"PROCS & FUNCS" = "PROCS & FUNCS";

/* toolbar item label for switching to the Run Query tab */
"Query" = "Query";

/* Query cancelled error */
"Query cancelled." = "Query cancelled.";

/* Query cancel by resetting connection error */
"Query cancelled.  Please note that to cancel the query the connection had to be reset; transactions and connection variables were reset." = "Query cancelled.  Please note that to cancel the query the connection had to be reset; transactions and connection variables were reset.";

/* No comment provided by engineer. */
"Query Editor" = "Query Editor";

/* query logging disabled label */
"Query logging is currently disabled" = "Query logging is currently disabled";

/* query result print heading */
"Query Result" = "Query Result";

/* text showing that app is reading dump */
"Reading..." = "Reading...";

/* menu item to refresh databases */
"Refresh Databases" = "Refresh Databases";

/* refresh list menu item */
"Refresh List" = "Refresh List";

/* toolbar item label for switching to the Table Relations tab */
"Relations" = "Relations";

/* Relations tab subtitle showing table name */
"Relations for table: %@" = "Relations for table: %@";

/* Reloading data task description */
"Reloading data..." = "Reloading data...";

/* remove button */
"Remove" = "Remove";

/* remove all button */
"Remove All" = "Remove All";

/* remove all query favorites message */
"Remove all query favorites?" = "Remove all query favorites?";

/* remove selected content filters message */
"Remove selected content filters?" = "Remove selected content filters?";

/* remove selected query favorites message */
"Remove selected query favorites?" = "Remove selected query favorites?";

/* removing field task status message */
"Removing field..." = "Removing field...";

/* removing index task status message */
"Removing index..." = "Removing index...";

/* rename item name to: */
"Rename %@ '%@' to:" = "Rename %1$@ '%2$@' to:";

/* rename database message */
"Rename database '%@' to:" = "Rename database '%@' to:";

/* rename func menu title */
"Rename Function..." = "Rename Function...";

/* rename proc menu title */
"Rename Procedure..." = "Rename Procedure...";

/* rename table menu title */
"Rename Table..." = "Rename Table...";

/* rename view menu title */
"Rename View..." = "Rename View...";

/* REPAIR one or more tables - result title */
"Repair %@" = "Repair %@";

/* repair selected items menu item */
"Repair Selected Items" = "Repair Selected Items";

/* repair table menu item */
"Repair Table" = "Repair Table";

/* repair table failed message */
"Repair table failed." = "Repair table failed.";

/* reset auto_increment after deletion of all rows message */
"Reset AUTO_INCREMENT after deletion?" = "Reset AUTO_INCREMENT after deletion?";

/* Restoring session task description */
"Restoring session..." = "Restoring session...";

/* return type label */
"Return Type" = "Return Type";

/* return type: %@ */
"return type: %@" = "return type: %@";

/* singular word for row */
"row" = "row";

/* plural word for rows */
"rows" = "rows";

/* text showing how many rows are in the limited filter match */
"Rows %@ - %@ from filtered matches" = "Rows %1$@ - %2$@ from filtered matches";

/* text showing how many rows are in the limited result */
"Rows %@ - %@ of %@%@ from table" = "Rows %1$@ - %2$@ of %3$@%4$@ from table";

/* rows: %@ */
"rows: %@" = "rows: %@";

/* rows: ~%@ */
"rows: ~%@" = "rows: ~%@";

/* run all button */
"Run All" = "Run All";

/* Title of button to run current query in custom query view */
"Run Current" = "Run Current";

/* Title of action menu item to run current query in custom query view */
"Run Current Query" = "Run Current Query";

/* toolbar item label for switching to the Run Query tab */
"Run Custom Query" = "Run Custom Query";

/* Title of button to run query just before text caret in custom query view */
"Run Previous" = "Run Previous";

/* Title of action menu item to run query just before text caret in custom query view */
"Run Previous Query" = "Run Previous Query";

/* Title of action menu item to run selected text in custom query view */
"Run Selected Text" = "Run Selected Text";

/* Title of button to run selected text in custom query view */
"Run Selection" = "Run Selection";

/* Running multiple queries string */
"Running query %i of %lu..." = "Running query %1$i of %2$lu...";

/* Running multiple queries string */
"Running query %ld of %lu..." = "Running query %1$ld of %2$lu...";

/* Running single query string */
"Running query..." = "Running query...";

/* Save All to Favorites */
"Save All to Favorites" = "Save All to Favorites";

/* save as button title */
"Save As..." = "Save As...";

/* Save Current Query to Favorites */
"Save Current Query to Favorites" = "Save Current Query to Favorites";

/* Save Queries… */
"Save Queries…" = "Save Queries…";

/* Save Query… */
"Save Query…" = "Save Query…";

/* Save Selection to Favorites */
"Save Selection to Favorites" = "Save Selection to Favorites";

/* Save SQL file */
"Save SQL file" = "Save SQL file";

/* save view as button title */
"Save View As..." = "Save View As...";

/* schema path header for completion tooltip */
"Schema path:" = "Schema path:";

/* Search in MySQL Documentation */
"Search in MySQL Documentation" = "Search in MySQL Documentation";

/* Search in MySQL Help */
"Search in MySQL Help" = "Search in MySQL Help";

/* Select Active Query */
"Select Active Query" = "Select Active Query";

/* toolbar item for selecting a db */
"Select Database" = "Select Database";

/* selected items */
"selected items" = "selected items";

/* server processes window title */
"Server Processes" = "Server Processes";

/* No comment provided by engineer. */
"Shortcuts" = "Shortcuts";

/* show console */
"Show Console" = "Show Console";

/* show create func syntax menu item */
"Show Create Function Syntax..." = "Show Create Function Syntax...";

/* show create proc syntax menu item */
"Show Create Procedure Syntax..." = "Show Create Procedure Syntax...";

/* show create table syntax menu item */
"Show Create Table Syntax..." = "Show Create Table Syntax...";

/* show create view syntax menu item */
"Show Create View Syntax..." = "Show Create View Syntax...";

/* Show detail button */
"Show Detail" = "Show Detail";

/* show mysql help for */
"Show MySQL help for" = "Show MySQL help for";

/* show navigator */
"Show Navigator" = "Show Navigator";

/* Show Query Information */
"Show Query Information" = "Show Query Information";

/* show tab bar */
"Show Tab Bar" = "Show Tab Bar";

/* Show Table Information */
"Show Table Information" = "Show Table Information";

/* tooltip for toolbar item for show console */
"Show the console which shows all MySQL commands performed by Sequel Pro" = "Show the console which shows all MySQL commands performed by Sequel Pro";

/* filtered item count */
"Showing %lu of %lu processes" = "Showing %1$lu of %2$lu processes";

/* size: %@ */
"size: %@" = "size: %@";

/* socket connection failed title */
"Socket connection failed!" = "Socket connection failed!";

/* socket not found title */
"Socket not found!" = "Socket not found!";

/* Sorting table task description */
"Sorting table..." = "Sorting table...";

/* SSH connected titlebar marker */
"SSH Connected" = "SSH Connected";

/* SSH connecting very short status message */
"SSH connecting..." = "SSH connecting...";

/* SSH connecting titlebar marker */
"SSH Connecting…" = "SSH Connecting…";

/* SSH connection failed title */
"SSH connection failed!" = "SSH connection failed!";

/* SSH disconnected titlebar marker */
"SSH Disconnected" = "SSH Disconnected";

/* title when ssh tunnel port forwarding failed */
"SSH port forwarding failed" = "SSH port forwarding failed";

/* stop button */
"Stop" = "Stop";

/* Stop queries string */
"Stop queries" = "Stop queries";

/* Stop query string */
"Stop query" = "Stop query";

/* toolbar item label for switching to the Table Structure tab */
"Structure" = "Structure";

/* successfully analyzed all selected items message */
"Successfully analyzed all selected items." = "Successfully analyzed all selected items.";

/* analyze table successfully passed message */
"Successfully analyzed table." = "Successfully analyzed table.";

/* successfully flushed all selected items message */
"Successfully flushed all selected items." = "Successfully flushed all selected items.";

/* message of panel when successfully flushed privs */
"Successfully flushed privileges." = "Successfully flushed privileges.";

/* flush table successfully passed message */
"Successfully flushed table." = "Successfully flushed table.";

/* successfully optimized all selected items message */
"Successfully optimized all selected items." = "Successfully optimized all selected items.";

/* optimize table successfully passed message */
"Successfully optimized table." = "Successfully optimized table.";

/* successfully repaired all selected items message */
"Successfully repaired all selected items." = "Successfully repaired all selected items.";

/* repair table successfully passed message */
"Successfully repaired table." = "Successfully repaired table.";

/* tooltip for toolbar item for switching to the Run Query tab */
"Switch to the Run Query tab" = "Switch to the Run Query tab";

/* tooltip for toolbar item for switching to the Table Content tab */
"Switch to the Table Content tab" = "Switch to the Table Content tab";

/* tooltip for toolbar item for switching to the Table Info tab */
"Switch to the Table Info tab" = "Switch to the Table Info tab";

/* tooltip for toolbar item for switching to the Table Relations tab */
"Switch to the Table Relations tab" = "Switch to the Table Relations tab";

/* tooltip for toolbar item for switching to the Table Structure tab */
"Switch to the Table Structure tab" = "Switch to the Table Structure tab";

/* tooltip for toolbar item for switching to the Table Triggers tab */
"Switch to the Table Triggers tab" = "Switch to the Table Triggers tab";

/* tooltip for toolbar item for switching to the User Manager tab */
"Switch to the User Manager tab" = "Switch to the User Manager tab";

/* description for table syntax copied growl notification */
"Syntax for %@ table copied" = "Syntax for %@ table copied";

/* table */
"table" = "table";

/* csv export table heading */
"Table" = "Table";

/* export label showing that the app is fetching data for a specific table */
"Table %lu of %lu (%@): Fetching data..." = "Table %1$lu of %2$lu (%3$@): Fetching data...";

/* export label showing app is fetching relations data for a specific table */
"Table %lu of %lu (%@): Fetching relations data..." = "Table %1$lu of %2$lu (%3$@): Fetching relations data...";

/* export label showing app if writing data for a specific table */
"Table %lu of %lu (%@): Writing data..." = "Table %1$lu of %2$lu (%3$@): Writing data...";

/* table checksum message */
"Table checksum" = "Table checksum";

/* table checksum: %@ */
"Table checksum: %@" = "Table checksum: %@";

/* table content print heading */
"Table Content" = "Table Content";

/* toolbar item for navigation history */
"Table History" = "Table History";

/* toolbar item label for switching to the Table Info tab */
"Table Info" = "Table Info";

/* table information print heading */
"Table Information" = "Table Information";

/* header for table info pane */
"TABLE INFORMATION" = "TABLE INFORMATION";

/* message of panel when no name is given for table */
"Table must have a name." = "Table must have a name.";

/* toolbar item label for switching to the Table Relations tab */
"Table Relations" = "Table Relations";

/* table structure print heading */
"Table Structure" = "Table Structure";

/* toolbar item label for switching to the Table Triggers tab */
"Table Triggers" = "Table Triggers";

/* Add Relation sheet title, showing table name */
"Table: %@" = "Table: %@";

/* tables */
"tables" = "tables";

/* No comment provided by engineer. */
"Tables" = "Tables";

/* header for table list */
"TABLES" = "TABLES";

/* header for table & views list */
"TABLES & VIEWS" = "TABLES & VIEWS";

/* Text is too long. Maximum text length is set to %llu. */
"Text is too long. Maximum text length is set to %llu." = "Text is too long. Maximum text length is set to %llu.";

/* message while reading a spf file which matches non-supported formats. */
"The chosen file “%@” contains ‘%@’ data." = "The chosen file “%1$@” contains ‘%2$@’ data.";

/* the connection is busy. please wait and try again tooltip */
"The connection is busy. Please wait and try again." = "The connection is busy. Please wait and try again.";

/* the connection of the active connection window is not identical tooltip */
"The connection of the active connection window is not identical." = "The connection of the active connection window is not identical.";

/* Connection lost during import error message */
"The connection to the server was lost during the import.  The import is only partially complete." = "The connection to the server was lost during the import.  The import is only partially complete.";

/* Create syntax permission denied detail */
"The creation syntax could not be retrieved due to a permissions error.\n\nPlease check your user permissions with an administrator." = "The creation syntax could not be retrieved due to a permissions error.\n\nPlease check your user permissions with an administrator.";

/* CSV file open error */
"The CSV file you selected could not be found or read." = "The CSV file you selected could not be found or read.";

/* Error when CSV appears to have too many columns to import, probably due to line ending mismatch */
"The CSV was read as containing more than 512 columns, more than the maximum columns permitted for speed reasons by Sequel Pro.\n\nThis usually happens due to errors reading the CSV; please double-check the CSV to be imported and the line endings and escape characters at the bottom of the CSV selection dialog." = "The CSV was read as containing more than 512 columns, more than the maximum columns permitted for speed reasons by Sequel Pro.\n\nThis usually happens due to errors reading the CSV; please double-check the CSV to be imported and the line endings and escape characters at the bottom of the CSV selection dialog.";

/* delete index and foreign key informative message */
"The foreign key relationship '%@' has a dependency on this index. This relationship must be removed before the index can be deleted.\n\nAre you sure you want to continue to delete the relationship and the index? This action cannot be undone." = "The foreign key relationship '%@' has a dependency on this index. This relationship must be removed before the index can be deleted.\n\nAre you sure you want to continue to delete the relationship and the index? This action cannot be undone.";

/* message when trying to rename a table/view/proc/etc to an already used name */
"The name '%@' is already used." = "The name '%@' is already used.";

/* message of panel when no rows have been affected after writing to the db */
"The row was not written to the MySQL database. You probably haven't changed anything.\nReload the table to be sure that the row exists and use a primary key for your table.\n(This error can be turned off in the preferences.)" = "The row was not written to the MySQL database. You probably haven't changed anything.\nReload the table to be sure that the row exists and use a primary key for your table.\n(This error can be turned off in the preferences.)";

/* error deleting relation informative message */
"The selected relation couldn't be deleted.\n\nMySQL said: %@" = "The selected relation couldn't be deleted.\n\nMySQL said: %@";

/* error deleting trigger informative message */
"The selected trigger couldn't be deleted.\n\nMySQL said: %@" = "The selected trigger couldn't be deleted.\n\nMySQL said: %@";

/* message of panel when connection to socket failed because optional socket could not be found */
"The socket file could not be found in any common location. Please supply the correct socket location.\n\nMySQL said: %@" = "The socket file could not be found in any common location. Please supply the correct socket location.\n\nMySQL said: %@";

/* error creating relation informative message */
"The specified relation was unable to be created.\n\nMySQL said: %@" = "The specified relation was unable to be created.\n\nMySQL said: %@";

/* error creating trigger informative message */
"The specified trigger was unable to be created.\n\nMySQL said: %@" = "The specified trigger was unable to be created.\n\nMySQL said: %@";

/* SQL file open error */
"The SQL file you selected could not be found or read." = "The SQL file you selected could not be found or read.";

/* SSH tunnel authentication failed message */
"The SSH Tunnel could not authenticate with the remote host. Please check your password and ensure you still have access." = "The SSH Tunnel could not authenticate with the remote host. Please check your password and ensure you still have access.";

/* SSH tunnel could not be security marked by Sequel Pro */
"The SSH Tunnel could not safely be marked as belonging to Sequel Pro, and so has been shut down for security reasons.  Please try again.\n\n(Error %i)" = "The SSH Tunnel could not safely be marked as belonging to Sequel Pro, and so has been shut down for security reasons.  Please try again.\n\n(Error %i)";

/* SSH tunnel unexpectedly closed */
"The SSH Tunnel has unexpectedly closed." = "The SSH Tunnel has unexpectedly closed.";

/* SSH tunnel was closed by remote host message */
"The SSH Tunnel was closed 'by the remote host'. This may indicate a networking issue or a network timeout." = "The SSH Tunnel was closed 'by the remote host'. This may indicate a networking issue or a network timeout.";

/* SSH tunnel forwarding port connection refused message */
"The SSH Tunnel was established successfully, but could not forward data to the remote port as the remote port refused the connection." = "The SSH Tunnel was established successfully, but could not forward data to the remote port as the remote port refused the connection.";

/* SSH tunnel unable to bind to local port message */
"The SSH Tunnel was unable to bind to the local port. This error may occur if you already have an SSH connection to the same server and are using a 'LocalForward' setting in your SSH configuration.\n\nWould you like to fall back to a standard connection to localhost in order to use the existing tunnel?" = "The SSH Tunnel was unable to bind to the local port. This error may occur if you already have an SSH connection to the same server and are using a 'LocalForward' setting in your SSH configuration.\n\nWould you like to fall back to a standard connection to localhost in order to use the existing tunnel?";

/* SSH tunnel failed or timed out message */
"The SSH Tunnel was unable to connect to host %@, or the request timed out.\n\nBe sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %ld seconds)." = "The SSH Tunnel was unable to connect to host %1$@, or the request timed out.\n\nBe sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %2$ld seconds).";

/* message of panel when table content cannot be copied */
"There have been errors while copying table content. Please control the new table." = "There have been errors while copying table content. Please control the new table.";

/* text shown when query was successfull */
"There were no errors." = "There were no errors.";

/* delete field and foreign key informative message */
"This field is part of a foreign key relationship with the table '%@'. This relationship must be removed before the field can be deleted.\n\nAre you sure you want to continue to delete the relationship and the field? This action cannot be undone." = "This field is part of a foreign key relationship with the table '%@'. This relationship must be removed before the field can be deleted.\n\nAre you sure you want to continue to delete the relationship and the field? This action cannot be undone.";

/* This table currently does not support relations. Only tables that use the InnoDB storage engine support them. */
"This table currently does not support relations. Only tables that use the InnoDB storage engine support them." = "This table currently does not support relations. Only tables that use the InnoDB storage engine support them.";

/* triggers not supported label */
"This version of MySQL does not support triggers. Support for triggers was added in MySQL 5.0.2" = "This version of MySQL does not support triggers. Support for triggers was added in MySQL 5.0.2";

/* export filename time token */
"time" = "time";

/* message of error when using 'localhost' for a network connection */
"To MySQL, 'localhost' is a special host and means that a socket connection should be used.\n\nDid you mean to use a socket connection, or to connect to the local machine via a port?  If you meant to connect via a port, '127.0.0.1' should be used instead of 'localhost'." = "To MySQL, 'localhost' is a special host and means that a socket connection should be used.\n\nDid you mean to use a socket connection, or to connect to the local machine via a port?  If you meant to connect via a port, '127.0.0.1' should be used instead of 'localhost'.";

/* toolbar item label for switching to the Table Triggers tab */
"Triggers" = "Triggers";

/* triggers for table label */
"Triggers for table: %@" = "Triggers for table: %@";

/* truncate button */
"Truncate" = "Truncate";

/* truncate tables message */
"Truncate selected tables?" = "Truncate selected tables?";

/* truncate table menu title */
"Truncate Table" = "Truncate Table";

/* truncate table message */
"Truncate table '%@'?" = "Truncate table '%@'?";

/* truncate tables menu item */
"Truncate Tables" = "Truncate Tables";

/* type label */
"Type" = "Type";

/* type declaration header */
"Type Declaration:" = "Type Declaration:";

/* add index error message */
"Unable to add index" = "Unable to add index";

/* unable to analyze selected items message */
"Unable to analyze selected items" = "Unable to analyze selected items";

/* unable to analyze table message */
"Unable to analyze table" = "Unable to analyze table";

/* unable to check selected items message */
"Unable to check selected items" = "Unable to check selected items";

/* unable to check table message */
"Unable to check table" = "Unable to check table";

/* message of panel when connection to db failed after selecting from popupbutton */
"Unable to connect to database %@.\nBe sure that you have the necessary privileges." = "Unable to connect to database %@.\nBe sure that you have the necessary privileges.";

/* message of panel when connection to host failed due to access denied error */
"Unable to connect to host %@ because access was denied.\n\nDouble-check your username and password and ensure that access from your current location is permitted.\n\nMySQL said: %@" = "Unable to connect to host %1$@ because access was denied.\n\nDouble-check your username and password and ensure that access from your current location is permitted.\n\nMySQL said: %2$@";

/* message of panel when SSH port forwarding failed */
"Unable to connect to host %@ because the port connection via SSH was refused.\n\nPlease ensure that your MySQL host is set up to allow TCP/IP connections (no --skip-networking) and is configured to allow connections from the host you are tunnelling via.\n\nYou may also want to check the port is correct and that you have the necessary privileges.\n\nChecking the error detail will show the SSH debug log which may provide more details.\n\nMySQL said: %@" = "Unable to connect to host %1$@ because the port connection via SSH was refused.\n\nPlease ensure that your MySQL host is set up to allow TCP/IP connections (no --skip-networking) and is configured to allow connections from the host you are tunnelling via.\n\nYou may also want to check the port is correct and that you have the necessary privileges.\n\nChecking the error detail will show the SSH debug log which may provide more details.\n\nMySQL said: %2$@";

/* message of panel when connection to host failed */
"Unable to connect to host %@, or the request timed out.\n\nBe sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %ld seconds).\n\nMySQL said: %@" = "Unable to connect to host %1$@, or the request timed out.\n\nBe sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %2$ld seconds).\n\nMySQL said: %3$@";

/* message of panel when connection to host failed */
"Unable to connect via the socket, or the request timed out.\n\nDouble-check that the socket path is correct and that you have the necessary privileges, and that the server is running.\n\nMySQL said: %@" = "Unable to connect via the socket, or the request timed out.\n\nDouble-check that the socket path is correct and that you have the necessary privileges, and that the server is running.\n\nMySQL said: %@";

/* error deleting index message */
"Unable to delete index" = "Unable to delete index";

/* error deleting relation message */
"Unable to delete relation" = "Unable to delete relation";

/* error deleting trigger message */
"Unable to delete trigger" = "Unable to delete trigger";

/* unable to flush selected items message */
"Unable to flush selected items" = "Unable to flush selected items";

/* unable to flush table message */
"Unable to flush table" = "Unable to flush table";

/* unable to get list of users message */
"Unable to get list of users" = "Unable to get list of users";

/* error killing connection message */
"Unable to kill connection" = "Unable to kill connection";

/* error killing query message */
"Unable to kill query" = "Unable to kill query";

/* unable to optimze selected items message */
"Unable to optimze selected items" = "Unable to optimze selected items";

/* unable to optimze table message */
"Unable to optimze table" = "Unable to optimze table";

/* unable to perform the checksum */
"Unable to perform the checksum" = "Unable to perform the checksum";

/* unable to repair selected items message */
"Unable to repair selected items" = "Unable to repair selected items";

/* unable to repair table message */
"Unable to repair table" = "Unable to repair table";

/* updated: %@ */
"updated: %@" = "updated: %@";

/* message of panel when error while updating field to db after enabling it */
"Updating field content failed. Couldn't identify field origin unambiguously (%ld match%@). It's very likely that while editing this field the table `%@` was changed by an other user." = "Updating field content failed. Couldn't identify field origin unambiguously (%1$ld match%2$@). It's very likely that while editing this field the table `%3$@` was changed by an other user.";

/* Use 127.0.0.1 button */
"Use 127.0.0.1" = "Use 127.0.0.1";

/* use standard connection button */
"Use Standard Connection" = "Use Standard Connection";

/* toolbar item label for switching to the User Manager tab */
"Users" = "Users";

/* version */
"version" = "version";

/* view */
"view" = "view";

/* header for view info pane */
"VIEW INFORMATION" = "VIEW INFORMATION";

/* views */
"views" = "views";

/* warning */
"Warning" = "Warning";

/* Generic working description */
"Working..." = "Working...";

/* export label showing app is writing data */
"Writing data..." = "Writing data...";

/* text showing that app is writing text file */
"Writing..." = "Writing...";

/* wrong data format or password */
"Wrong data format or password." = "Wrong data format or password.";

/* wrong data format */
"Wrong data format." = "Wrong data format.";

/* message of panel when trying to copy multiple rows */
"You can only copy single rows." = "You can only copy single rows.";

/* message of panel when trying to edit tables without index and with hidden blob/text fields */
"You can't hide blob and text fields when working with tables without index." = "You can't hide blob and text fields when working with tables without index.";

/* You cannot delete the last field in a table. Delete the table instead. */
"You cannot delete the last field in a table. Delete the table instead." = "You cannot delete the last field in a table. Delete the table instead.";

/* title of error when using 'localhost' for a network connection */
"You have entered 'localhost' for a non-socket connection" = "You have entered 'localhost' for a non-socket connection";

/* content filter for field type ‘%@’ */
"‘%@’ Fields Content Filters" = "‘%@’ Fields Content Filters";

/* “%@” couldn't be parsed. You can edit the column setup but the column will not be shown in the Content view; please report this issue to the Sequel Pro team using the Help menu item. */
"“%@” couldn't be parsed. You can edit the column setup but the column will not be shown in the Content view; please report this issue to the Sequel Pro team using the Help menu item." = "“%@” couldn't be parsed. You can edit the column setup but the column will not be shown in the Content view; please report this issue to the Sequel Pro team using the Help menu item.";

